Tescripts/k6-tests-new/thushajini-test/Exp_A_15.txt
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: Exp_A_15.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 500 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

WARN[0122] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0122] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0122] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
[...]
WARN[0123] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0123] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0123] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
[...]
WARN[0124] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0124] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0124] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
[...]
WARN[0125] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0125] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0125] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
[...]
WARN[0126] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0126] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0126] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
[...]
WARN[0127] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0127] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0127] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
[...]
WARN[0156] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0156] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0156] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
[...]
WARN[0252] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0252] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
WARN[0252] Request Failed                                error="Post \"http://localhost:3000/api/orders\": EOF"
[...]


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<3000' p(95)=3.07s

    http_req_failed
    ✗ 'rate<0.10' rate=23.18%


  █ TOTAL RESULTS 

    checks_total.......: 104222 346.253617/s
    checks_succeeded...: 85.88% 89515 out of 104222
    checks_failed......: 14.11% 14707 out of 104222

    ✗ status is 201
      ↳  76% — ✓ 40027 / ✗ 12084
    ✗ response time < 3000 ms
      ↳  94% — ✓ 49488 / ✗ 2623

    HTTP
    http_req_duration..............: avg=1.47s min=445.29µs med=155.47ms max=59.84s p(90)=977.4ms  p(95)=3.07s
      { expected_response:true }...: avg=1.38s min=994.5µs  med=214.81ms max=59.84s p(90)=940.45ms p(95)=1.32s
    http_req_failed................: 23.18% 12084 out of 52111
    http_reqs......................: 52111  173.126809/s

    EXECUTION
    iteration_duration.............: avg=2.47s min=1s       med=1.15s    max=1m0s   p(90)=1.97s    p(95)=4.08s
    iterations.....................: 52111  173.126809/s
    vus............................: 15     min=2              max=500
    vus_max........................: 500    min=500            max=500

    NETWORK
    data_received..................: 18 MB  60 kB/s
    data_sent......................: 19 MB  64 kB/s



running (5m01.0s), 000/500 VUs, 52111 complete and 0 interrupted iterations
default ✓ [======================================] 000/500 VUs  5m0s
ERRO[0301] thresholds on metrics 'http_req_duration, http_req_failed' have been crossed